#Напишіть програму, яка визначає, чи є рік високосним, згідно з такими правилами:

#Рік є високосним, якщо він кратний 4.
#Однак, якщо рік кратний 100, то він не є високосним, окрім випадку, коли він також кратний 400.
#Умови:
#Якщо рік високосний, програма повинна вивести "Рік високосний".
#Якщо рік не високосний, програма повинна вивести "Рік не високосний".

year = int(input("Який зараз рік?"))
if year/4==0 and year/100!=0 or year/400 == 0:
    print('Рік є високосний')
else: 
    print("Рік не високосний")